layer {
  name: "data"
  type: "MultiLabelImageData"
  top: "data"
  top: "label"
  transform_param {
    crop_size: 224
  }
  multi_label_image_data_param {
    source: "/home/liyong/code/code/py-faster-rcnn/data/RAF/list/96_128_train.txt"
    batch_size: 12
    shuffle: true
    new_height: 232
    new_width: 232
    root_folder: "/home/liyong/code/code/py-faster-rcnn/data/RAF/better_png_occlusion_cropped/96_128/"
    label_num: 49
  }
}
layer {
  name: "emotion_label"
  type: "Slice"
  bottom: "label"
  top: "emotion_label"
  top: "roi_label"
  slice_param {
    slice_point: 1
    axis: 1
  }
}
layer {
  name: "rois"
  type: "Reshape"
  bottom: "roi_label"
  top: "rois"
  reshape_param {
    shape {
      dim: 12
      dim: 24
      dim: 2
    }
  }
}
layer {
  name: "data_bn"
  type: "BatchNorm"
  bottom: "data"
  top: "data_bn"
}
layer {
  name: "data_scale"
  type: "Scale"
  bottom: "data_bn"
  top: "data_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data_scale"
  top: "conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_1_bn"
  type: "BatchNorm"
  bottom: "conv1_1"
  top: "conv1_1_bn"
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1_bn"
  top: "conv1_1_bn"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1_bn"
  top: "conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_2_bn"
  type: "BatchNorm"
  bottom: "conv1_2"
  top: "conv1_2_bn"
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2_bn"
  top: "conv1_2_bn"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2_bn"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_1_bn"
  type: "BatchNorm"
  bottom: "conv2_1"
  top: "conv2_1_bn"
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1_bn"
  top: "conv2_1_bn"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1_bn"
  top: "conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_2_bn"
  type: "BatchNorm"
  bottom: "conv2_2"
  top: "conv2_2_bn"
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2_bn"
  top: "conv2_2_bn"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2_bn"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_1_bn"
  type: "BatchNorm"
  bottom: "conv3_1"
  top: "conv3_1_bn"
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1_bn"
  top: "conv3_1_bn"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1_bn"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_2_bn"
  type: "BatchNorm"
  bottom: "conv3_2"
  top: "conv3_2_bn"
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2_bn"
  top: "conv3_2_bn"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2_bn"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv3_3_bn"
  type: "BatchNorm"
  bottom: "conv3_3"
  top: "conv3_3_bn"
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3_bn"
  top: "conv3_3_bn"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3_bn"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_1_bn"
  type: "BatchNorm"
  bottom: "conv4_1"
  top: "conv4_1_bn"
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1_bn"
  top: "conv4_1_bn"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1_bn"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_2_bn"
  type: "BatchNorm"
  bottom: "conv4_2"
  top: "conv4_2_bn"
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2_bn"
  top: "conv4_2_bn"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2_bn"
  top: "conv4_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv4_3_bn"
  type: "BatchNorm"
  bottom: "conv4_3"
  top: "conv4_3_bn"
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3_bn"
  top: "conv4_3_bn"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3_bn"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv5_1_bn"
  type: "BatchNorm"
  bottom: "conv5_1"
  top: "conv5_1_bn"
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1_bn"
  top: "conv5_1_bn"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1_bn"
  top: "conv5_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv5_2_bn"
  type: "BatchNorm"
  bottom: "conv5_2"
  top: "conv5_2_bn"
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2_bn"
  top: "conv5_2_bn"
}
layer {
  name: "full_poo1"
  type: "Pooling"
  bottom: "conv5_2_bn"
  top: "full_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "full_mask_conv_1"
  type: "Convolution"
  bottom: "full_poo1"
  top: "full_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "full_mask_bn1"
  type: "BatchNorm"
  bottom: "full_mask_conv_1"
  top: "full_mask_bn1"
}
layer {
  name: "full_mask_relu1"
  type: "ReLU"
  bottom: "full_mask_bn1"
  top: "full_mask_bn1"
}
layer {
  name: "full_mask_pool"
  type: "Pooling"
  bottom: "full_mask_bn1"
  top: "full_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "full_mask_fc1"
  type: "InnerProduct"
  bottom: "full_mask_pool"
  top: "full_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "full_mask_bn2"
  type: "BatchNorm"
  bottom: "full_mask_fc1"
  top: "full_mask_bn2"
}
layer {
  name: "full_mask_fc_relu1"
  type: "ReLU"
  bottom: "full_mask_bn2"
  top: "full_mask_bn2"
}
layer {
  name: "full_mask_fc_2"
  type: "InnerProduct"
  bottom: "full_mask_bn2"
  top: "full_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "full_mask_bn3"
  type: "BatchNorm"
  bottom: "full_mask_fc_2"
  top: "full_mask_bn3"
}
layer {
  name: "full_mask_scale3"
  type: "Scale"
  bottom: "full_mask_bn3"
  top: "full_mask_bn3"
}
layer {
  name: "roi1"
  type: "MultiROIPooling"
  bottom: "conv4_2_bn"
  bottom: "rois"
  top: "roi1"
  top: "roi2"
  top: "roi3"
  top: "roi4"
  top: "roi5"
  top: "roi6"
  top: "roi7"
  top: "roi8"
  top: "roi9"
  top: "roi10"
  top: "roi11"
  top: "roi12"
  top: "roi13"
  top: "roi14"
  top: "roi15"
  top: "roi16"
  top: "roi17"
  top: "roi18"
  top: "roi19"
  top: "roi20"
  top: "roi21"
  top: "roi22"
  top: "roi23"
  top: "roi24"
  multi_roi_pooling_param {
    pooled_h: 6
    pooled_w: 6
    spatial_scale: 0.125
    top_num: 24
  }
}
layer {
  name: "roi1_conv1_1"
  type: "Convolution"
  bottom: "roi1"
  top: "roi1_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi1_bn1_1"
  type: "BatchNorm"
  bottom: "roi1_conv1_1"
  top: "roi1_bn1_1"
}
layer {
  name: "roi1_relu1_1"
  type: "ReLU"
  bottom: "roi1_bn1_1"
  top: "roi1_bn1_1"
}
layer {
  name: "roi1_conv2_1"
  type: "Convolution"
  bottom: "roi1_bn1_1"
  top: "roi1_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi1_bn2_1"
  type: "BatchNorm"
  bottom: "roi1_conv2_1"
  top: "roi1_bn2_1"
}
layer {
  name: "roi1_relu2_1"
  type: "ReLU"
  bottom: "roi1_bn2_1"
  top: "roi1_bn2_1"
}
layer {
  name: "roi1_poo1"
  type: "Pooling"
  bottom: "roi1_bn2_1"
  top: "roi1_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi1_mask_conv_1"
  type: "Convolution"
  bottom: "roi1_poo1"
  top: "roi1_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi1_mask_bn1"
  type: "BatchNorm"
  bottom: "roi1_mask_conv_1"
  top: "roi1_mask_bn1"
}
layer {
  name: "roi1_mask_relu1"
  type: "ReLU"
  bottom: "roi1_mask_bn1"
  top: "roi1_mask_bn1"
}
layer {
  name: "roi1_mask_pool"
  type: "Pooling"
  bottom: "roi1_mask_bn1"
  top: "roi1_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi1_mask_fc1"
  type: "InnerProduct"
  bottom: "roi1_mask_pool"
  top: "roi1_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi1_mask_bn2"
  type: "BatchNorm"
  bottom: "roi1_mask_fc1"
  top: "roi1_mask_bn2"
}
layer {
  name: "roi1_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi1_mask_bn2"
  top: "roi1_mask_bn2"
}
layer {
  name: "roi1_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi1_mask_bn2"
  top: "roi1_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi1_mask_bn3"
  type: "BatchNorm"
  bottom: "roi1_mask_fc_2"
  top: "roi1_mask_bn3"
}
layer {
  name: "roi1_mask_scale3"
  type: "Scale"
  bottom: "roi1_mask_bn3"
  top: "roi1_mask_bn3"
}
layer {
  name: "roi2_conv1_1"
  type: "Convolution"
  bottom: "roi2"
  top: "roi2_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi2_bn1_1"
  type: "BatchNorm"
  bottom: "roi2_conv1_1"
  top: "roi2_bn1_1"
}
layer {
  name: "roi2_relu1_1"
  type: "ReLU"
  bottom: "roi2_bn1_1"
  top: "roi2_bn1_1"
}
layer {
  name: "roi2_conv2_1"
  type: "Convolution"
  bottom: "roi2_bn1_1"
  top: "roi2_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi2_bn2_1"
  type: "BatchNorm"
  bottom: "roi2_conv2_1"
  top: "roi2_bn2_1"
}
layer {
  name: "roi2_relu2_1"
  type: "ReLU"
  bottom: "roi2_bn2_1"
  top: "roi2_bn2_1"
}
layer {
  name: "roi2_poo1"
  type: "Pooling"
  bottom: "roi2_bn2_1"
  top: "roi2_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi2_mask_conv_1"
  type: "Convolution"
  bottom: "roi2_poo1"
  top: "roi2_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi2_mask_bn1"
  type: "BatchNorm"
  bottom: "roi2_mask_conv_1"
  top: "roi2_mask_bn1"
}
layer {
  name: "roi2_mask_relu1"
  type: "ReLU"
  bottom: "roi2_mask_bn1"
  top: "roi2_mask_bn1"
}
layer {
  name: "roi2_mask_pool"
  type: "Pooling"
  bottom: "roi2_mask_bn1"
  top: "roi2_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi2_mask_fc1"
  type: "InnerProduct"
  bottom: "roi2_mask_pool"
  top: "roi2_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi2_mask_bn2"
  type: "BatchNorm"
  bottom: "roi2_mask_fc1"
  top: "roi2_mask_bn2"
}
layer {
  name: "roi2_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi2_mask_bn2"
  top: "roi2_mask_bn2"
}
layer {
  name: "roi2_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi2_mask_bn2"
  top: "roi2_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi2_mask_bn3"
  type: "BatchNorm"
  bottom: "roi2_mask_fc_2"
  top: "roi2_mask_bn3"
}
layer {
  name: "roi2_mask_scale3"
  type: "Scale"
  bottom: "roi2_mask_bn3"
  top: "roi2_mask_bn3"
}
layer {
  name: "roi3_conv1_1"
  type: "Convolution"
  bottom: "roi3"
  top: "roi3_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi3_bn1_1"
  type: "BatchNorm"
  bottom: "roi3_conv1_1"
  top: "roi3_bn1_1"
}
layer {
  name: "roi3_relu1_1"
  type: "ReLU"
  bottom: "roi3_bn1_1"
  top: "roi3_bn1_1"
}
layer {
  name: "roi3_conv2_1"
  type: "Convolution"
  bottom: "roi3_bn1_1"
  top: "roi3_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi3_bn2_1"
  type: "BatchNorm"
  bottom: "roi3_conv2_1"
  top: "roi3_bn2_1"
}
layer {
  name: "roi3_relu2_1"
  type: "ReLU"
  bottom: "roi3_bn2_1"
  top: "roi3_bn2_1"
}
layer {
  name: "roi3_poo1"
  type: "Pooling"
  bottom: "roi3_bn2_1"
  top: "roi3_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi3_mask_conv_1"
  type: "Convolution"
  bottom: "roi3_poo1"
  top: "roi3_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi3_mask_bn1"
  type: "BatchNorm"
  bottom: "roi3_mask_conv_1"
  top: "roi3_mask_bn1"
}
layer {
  name: "roi3_mask_relu1"
  type: "ReLU"
  bottom: "roi3_mask_bn1"
  top: "roi3_mask_bn1"
}
layer {
  name: "roi3_mask_pool"
  type: "Pooling"
  bottom: "roi3_mask_bn1"
  top: "roi3_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi3_mask_fc1"
  type: "InnerProduct"
  bottom: "roi3_mask_pool"
  top: "roi3_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi3_mask_bn2"
  type: "BatchNorm"
  bottom: "roi3_mask_fc1"
  top: "roi3_mask_bn2"
}
layer {
  name: "roi3_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi3_mask_bn2"
  top: "roi3_mask_bn2"
}
layer {
  name: "roi3_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi3_mask_bn2"
  top: "roi3_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi3_mask_bn3"
  type: "BatchNorm"
  bottom: "roi3_mask_fc_2"
  top: "roi3_mask_bn3"
}
layer {
  name: "roi3_mask_scale3"
  type: "Scale"
  bottom: "roi3_mask_bn3"
  top: "roi3_mask_bn3"
}
layer {
  name: "roi4_conv1_1"
  type: "Convolution"
  bottom: "roi4"
  top: "roi4_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi4_bn1_1"
  type: "BatchNorm"
  bottom: "roi4_conv1_1"
  top: "roi4_bn1_1"
}
layer {
  name: "roi4_relu1_1"
  type: "ReLU"
  bottom: "roi4_bn1_1"
  top: "roi4_bn1_1"
}
layer {
  name: "roi4_conv2_1"
  type: "Convolution"
  bottom: "roi4_bn1_1"
  top: "roi4_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi4_bn2_1"
  type: "BatchNorm"
  bottom: "roi4_conv2_1"
  top: "roi4_bn2_1"
}
layer {
  name: "roi4_relu2_1"
  type: "ReLU"
  bottom: "roi4_bn2_1"
  top: "roi4_bn2_1"
}
layer {
  name: "roi4_poo1"
  type: "Pooling"
  bottom: "roi4_bn2_1"
  top: "roi4_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi4_mask_conv_1"
  type: "Convolution"
  bottom: "roi4_poo1"
  top: "roi4_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi4_mask_bn1"
  type: "BatchNorm"
  bottom: "roi4_mask_conv_1"
  top: "roi4_mask_bn1"
}
layer {
  name: "roi4_mask_relu1"
  type: "ReLU"
  bottom: "roi4_mask_bn1"
  top: "roi4_mask_bn1"
}
layer {
  name: "roi4_mask_pool"
  type: "Pooling"
  bottom: "roi4_mask_bn1"
  top: "roi4_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi4_mask_fc1"
  type: "InnerProduct"
  bottom: "roi4_mask_pool"
  top: "roi4_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi4_mask_bn2"
  type: "BatchNorm"
  bottom: "roi4_mask_fc1"
  top: "roi4_mask_bn2"
}
layer {
  name: "roi4_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi4_mask_bn2"
  top: "roi4_mask_bn2"
}
layer {
  name: "roi4_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi4_mask_bn2"
  top: "roi4_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi4_mask_bn3"
  type: "BatchNorm"
  bottom: "roi4_mask_fc_2"
  top: "roi4_mask_bn3"
}
layer {
  name: "roi4_mask_scale3"
  type: "Scale"
  bottom: "roi4_mask_bn3"
  top: "roi4_mask_bn3"
}
layer {
  name: "roi5_conv1_1"
  type: "Convolution"
  bottom: "roi5"
  top: "roi5_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi5_bn1_1"
  type: "BatchNorm"
  bottom: "roi5_conv1_1"
  top: "roi5_bn1_1"
}
layer {
  name: "roi5_relu1_1"
  type: "ReLU"
  bottom: "roi5_bn1_1"
  top: "roi5_bn1_1"
}
layer {
  name: "roi5_conv2_1"
  type: "Convolution"
  bottom: "roi5_bn1_1"
  top: "roi5_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi5_bn2_1"
  type: "BatchNorm"
  bottom: "roi5_conv2_1"
  top: "roi5_bn2_1"
}
layer {
  name: "roi5_relu2_1"
  type: "ReLU"
  bottom: "roi5_bn2_1"
  top: "roi5_bn2_1"
}
layer {
  name: "roi5_poo1"
  type: "Pooling"
  bottom: "roi5_bn2_1"
  top: "roi5_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi5_mask_conv_1"
  type: "Convolution"
  bottom: "roi5_poo1"
  top: "roi5_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi5_mask_bn1"
  type: "BatchNorm"
  bottom: "roi5_mask_conv_1"
  top: "roi5_mask_bn1"
}
layer {
  name: "roi5_mask_relu1"
  type: "ReLU"
  bottom: "roi5_mask_bn1"
  top: "roi5_mask_bn1"
}
layer {
  name: "roi5_mask_pool"
  type: "Pooling"
  bottom: "roi5_mask_bn1"
  top: "roi5_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi5_mask_fc1"
  type: "InnerProduct"
  bottom: "roi5_mask_pool"
  top: "roi5_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi5_mask_bn2"
  type: "BatchNorm"
  bottom: "roi5_mask_fc1"
  top: "roi5_mask_bn2"
}
layer {
  name: "roi5_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi5_mask_bn2"
  top: "roi5_mask_bn2"
}
layer {
  name: "roi5_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi5_mask_bn2"
  top: "roi5_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi5_mask_bn3"
  type: "BatchNorm"
  bottom: "roi5_mask_fc_2"
  top: "roi5_mask_bn3"
}
layer {
  name: "roi5_mask_scale3"
  type: "Scale"
  bottom: "roi5_mask_bn3"
  top: "roi5_mask_bn3"
}
layer {
  name: "roi6_conv1_1"
  type: "Convolution"
  bottom: "roi6"
  top: "roi6_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi6_bn1_1"
  type: "BatchNorm"
  bottom: "roi6_conv1_1"
  top: "roi6_bn1_1"
}
layer {
  name: "roi6_relu1_1"
  type: "ReLU"
  bottom: "roi6_bn1_1"
  top: "roi6_bn1_1"
}
layer {
  name: "roi6_conv2_1"
  type: "Convolution"
  bottom: "roi6_bn1_1"
  top: "roi6_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi6_bn2_1"
  type: "BatchNorm"
  bottom: "roi6_conv2_1"
  top: "roi6_bn2_1"
}
layer {
  name: "roi6_relu2_1"
  type: "ReLU"
  bottom: "roi6_bn2_1"
  top: "roi6_bn2_1"
}
layer {
  name: "roi6_poo1"
  type: "Pooling"
  bottom: "roi6_bn2_1"
  top: "roi6_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi6_mask_conv_1"
  type: "Convolution"
  bottom: "roi6_poo1"
  top: "roi6_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi6_mask_bn1"
  type: "BatchNorm"
  bottom: "roi6_mask_conv_1"
  top: "roi6_mask_bn1"
}
layer {
  name: "roi6_mask_relu1"
  type: "ReLU"
  bottom: "roi6_mask_bn1"
  top: "roi6_mask_bn1"
}
layer {
  name: "roi6_mask_pool"
  type: "Pooling"
  bottom: "roi6_mask_bn1"
  top: "roi6_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi6_mask_fc1"
  type: "InnerProduct"
  bottom: "roi6_mask_pool"
  top: "roi6_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi6_mask_bn2"
  type: "BatchNorm"
  bottom: "roi6_mask_fc1"
  top: "roi6_mask_bn2"
}
layer {
  name: "roi6_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi6_mask_bn2"
  top: "roi6_mask_bn2"
}
layer {
  name: "roi6_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi6_mask_bn2"
  top: "roi6_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi6_mask_bn3"
  type: "BatchNorm"
  bottom: "roi6_mask_fc_2"
  top: "roi6_mask_bn3"
}
layer {
  name: "roi6_mask_scale3"
  type: "Scale"
  bottom: "roi6_mask_bn3"
  top: "roi6_mask_bn3"
}
layer {
  name: "roi7_conv1_1"
  type: "Convolution"
  bottom: "roi7"
  top: "roi7_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi7_bn1_1"
  type: "BatchNorm"
  bottom: "roi7_conv1_1"
  top: "roi7_bn1_1"
}
layer {
  name: "roi7_relu1_1"
  type: "ReLU"
  bottom: "roi7_bn1_1"
  top: "roi7_bn1_1"
}
layer {
  name: "roi7_conv2_1"
  type: "Convolution"
  bottom: "roi7_bn1_1"
  top: "roi7_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi7_bn2_1"
  type: "BatchNorm"
  bottom: "roi7_conv2_1"
  top: "roi7_bn2_1"
}
layer {
  name: "roi7_relu2_1"
  type: "ReLU"
  bottom: "roi7_bn2_1"
  top: "roi7_bn2_1"
}
layer {
  name: "roi7_poo1"
  type: "Pooling"
  bottom: "roi7_bn2_1"
  top: "roi7_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi7_mask_conv_1"
  type: "Convolution"
  bottom: "roi7_poo1"
  top: "roi7_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi7_mask_bn1"
  type: "BatchNorm"
  bottom: "roi7_mask_conv_1"
  top: "roi7_mask_bn1"
}
layer {
  name: "roi7_mask_relu1"
  type: "ReLU"
  bottom: "roi7_mask_bn1"
  top: "roi7_mask_bn1"
}
layer {
  name: "roi7_mask_pool"
  type: "Pooling"
  bottom: "roi7_mask_bn1"
  top: "roi7_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi7_mask_fc1"
  type: "InnerProduct"
  bottom: "roi7_mask_pool"
  top: "roi7_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi7_mask_bn2"
  type: "BatchNorm"
  bottom: "roi7_mask_fc1"
  top: "roi7_mask_bn2"
}
layer {
  name: "roi7_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi7_mask_bn2"
  top: "roi7_mask_bn2"
}
layer {
  name: "roi7_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi7_mask_bn2"
  top: "roi7_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi7_mask_bn3"
  type: "BatchNorm"
  bottom: "roi7_mask_fc_2"
  top: "roi7_mask_bn3"
}
layer {
  name: "roi7_mask_scale3"
  type: "Scale"
  bottom: "roi7_mask_bn3"
  top: "roi7_mask_bn3"
}
layer {
  name: "roi8_conv1_1"
  type: "Convolution"
  bottom: "roi8"
  top: "roi8_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi8_bn1_1"
  type: "BatchNorm"
  bottom: "roi8_conv1_1"
  top: "roi8_bn1_1"
}
layer {
  name: "roi8_relu1_1"
  type: "ReLU"
  bottom: "roi8_bn1_1"
  top: "roi8_bn1_1"
}
layer {
  name: "roi8_conv2_1"
  type: "Convolution"
  bottom: "roi8_bn1_1"
  top: "roi8_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi8_bn2_1"
  type: "BatchNorm"
  bottom: "roi8_conv2_1"
  top: "roi8_bn2_1"
}
layer {
  name: "roi8_relu2_1"
  type: "ReLU"
  bottom: "roi8_bn2_1"
  top: "roi8_bn2_1"
}
layer {
  name: "roi8_poo1"
  type: "Pooling"
  bottom: "roi8_bn2_1"
  top: "roi8_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi8_mask_conv_1"
  type: "Convolution"
  bottom: "roi8_poo1"
  top: "roi8_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi8_mask_bn1"
  type: "BatchNorm"
  bottom: "roi8_mask_conv_1"
  top: "roi8_mask_bn1"
}
layer {
  name: "roi8_mask_relu1"
  type: "ReLU"
  bottom: "roi8_mask_bn1"
  top: "roi8_mask_bn1"
}
layer {
  name: "roi8_mask_pool"
  type: "Pooling"
  bottom: "roi8_mask_bn1"
  top: "roi8_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi8_mask_fc1"
  type: "InnerProduct"
  bottom: "roi8_mask_pool"
  top: "roi8_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi8_mask_bn2"
  type: "BatchNorm"
  bottom: "roi8_mask_fc1"
  top: "roi8_mask_bn2"
}
layer {
  name: "roi8_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi8_mask_bn2"
  top: "roi8_mask_bn2"
}
layer {
  name: "roi8_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi8_mask_bn2"
  top: "roi8_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi8_mask_bn3"
  type: "BatchNorm"
  bottom: "roi8_mask_fc_2"
  top: "roi8_mask_bn3"
}
layer {
  name: "roi8_mask_scale3"
  type: "Scale"
  bottom: "roi8_mask_bn3"
  top: "roi8_mask_bn3"
}
layer {
  name: "roi9_conv1_1"
  type: "Convolution"
  bottom: "roi9"
  top: "roi9_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi9_bn1_1"
  type: "BatchNorm"
  bottom: "roi9_conv1_1"
  top: "roi9_bn1_1"
}
layer {
  name: "roi9_relu1_1"
  type: "ReLU"
  bottom: "roi9_bn1_1"
  top: "roi9_bn1_1"
}
layer {
  name: "roi9_conv2_1"
  type: "Convolution"
  bottom: "roi9_bn1_1"
  top: "roi9_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi9_bn2_1"
  type: "BatchNorm"
  bottom: "roi9_conv2_1"
  top: "roi9_bn2_1"
}
layer {
  name: "roi9_relu2_1"
  type: "ReLU"
  bottom: "roi9_bn2_1"
  top: "roi9_bn2_1"
}
layer {
  name: "roi9_poo1"
  type: "Pooling"
  bottom: "roi9_bn2_1"
  top: "roi9_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi9_mask_conv_1"
  type: "Convolution"
  bottom: "roi9_poo1"
  top: "roi9_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi9_mask_bn1"
  type: "BatchNorm"
  bottom: "roi9_mask_conv_1"
  top: "roi9_mask_bn1"
}
layer {
  name: "roi9_mask_relu1"
  type: "ReLU"
  bottom: "roi9_mask_bn1"
  top: "roi9_mask_bn1"
}
layer {
  name: "roi9_mask_pool"
  type: "Pooling"
  bottom: "roi9_mask_bn1"
  top: "roi9_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi9_mask_fc1"
  type: "InnerProduct"
  bottom: "roi9_mask_pool"
  top: "roi9_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi9_mask_bn2"
  type: "BatchNorm"
  bottom: "roi9_mask_fc1"
  top: "roi9_mask_bn2"
}
layer {
  name: "roi9_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi9_mask_bn2"
  top: "roi9_mask_bn2"
}
layer {
  name: "roi9_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi9_mask_bn2"
  top: "roi9_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi9_mask_bn3"
  type: "BatchNorm"
  bottom: "roi9_mask_fc_2"
  top: "roi9_mask_bn3"
}
layer {
  name: "roi9_mask_scale3"
  type: "Scale"
  bottom: "roi9_mask_bn3"
  top: "roi9_mask_bn3"
}
layer {
  name: "roi10_conv1_1"
  type: "Convolution"
  bottom: "roi10"
  top: "roi10_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi10_bn1_1"
  type: "BatchNorm"
  bottom: "roi10_conv1_1"
  top: "roi10_bn1_1"
}
layer {
  name: "roi10_relu1_1"
  type: "ReLU"
  bottom: "roi10_bn1_1"
  top: "roi10_bn1_1"
}
layer {
  name: "roi10_conv2_1"
  type: "Convolution"
  bottom: "roi10_bn1_1"
  top: "roi10_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi10_bn2_1"
  type: "BatchNorm"
  bottom: "roi10_conv2_1"
  top: "roi10_bn2_1"
}
layer {
  name: "roi10_relu2_1"
  type: "ReLU"
  bottom: "roi10_bn2_1"
  top: "roi10_bn2_1"
}
layer {
  name: "roi10_poo1"
  type: "Pooling"
  bottom: "roi10_bn2_1"
  top: "roi10_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi10_mask_conv_1"
  type: "Convolution"
  bottom: "roi10_poo1"
  top: "roi10_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi10_mask_bn1"
  type: "BatchNorm"
  bottom: "roi10_mask_conv_1"
  top: "roi10_mask_bn1"
}
layer {
  name: "roi10_mask_relu1"
  type: "ReLU"
  bottom: "roi10_mask_bn1"
  top: "roi10_mask_bn1"
}
layer {
  name: "roi10_mask_pool"
  type: "Pooling"
  bottom: "roi10_mask_bn1"
  top: "roi10_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi10_mask_fc1"
  type: "InnerProduct"
  bottom: "roi10_mask_pool"
  top: "roi10_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi10_mask_bn2"
  type: "BatchNorm"
  bottom: "roi10_mask_fc1"
  top: "roi10_mask_bn2"
}
layer {
  name: "roi10_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi10_mask_bn2"
  top: "roi10_mask_bn2"
}
layer {
  name: "roi10_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi10_mask_bn2"
  top: "roi10_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi10_mask_bn3"
  type: "BatchNorm"
  bottom: "roi10_mask_fc_2"
  top: "roi10_mask_bn3"
}
layer {
  name: "roi10_mask_scale3"
  type: "Scale"
  bottom: "roi10_mask_bn3"
  top: "roi10_mask_bn3"
}
layer {
  name: "roi11_conv1_1"
  type: "Convolution"
  bottom: "roi11"
  top: "roi11_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi11_bn1_1"
  type: "BatchNorm"
  bottom: "roi11_conv1_1"
  top: "roi11_bn1_1"
}
layer {
  name: "roi11_relu1_1"
  type: "ReLU"
  bottom: "roi11_bn1_1"
  top: "roi11_bn1_1"
}
layer {
  name: "roi11_conv2_1"
  type: "Convolution"
  bottom: "roi11_bn1_1"
  top: "roi11_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi11_bn2_1"
  type: "BatchNorm"
  bottom: "roi11_conv2_1"
  top: "roi11_bn2_1"
}
layer {
  name: "roi11_relu2_1"
  type: "ReLU"
  bottom: "roi11_bn2_1"
  top: "roi11_bn2_1"
}
layer {
  name: "roi11_poo1"
  type: "Pooling"
  bottom: "roi11_bn2_1"
  top: "roi11_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi11_mask_conv_1"
  type: "Convolution"
  bottom: "roi11_poo1"
  top: "roi11_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi11_mask_bn1"
  type: "BatchNorm"
  bottom: "roi11_mask_conv_1"
  top: "roi11_mask_bn1"
}
layer {
  name: "roi11_mask_relu1"
  type: "ReLU"
  bottom: "roi11_mask_bn1"
  top: "roi11_mask_bn1"
}
layer {
  name: "roi11_mask_pool"
  type: "Pooling"
  bottom: "roi11_mask_bn1"
  top: "roi11_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi11_mask_fc1"
  type: "InnerProduct"
  bottom: "roi11_mask_pool"
  top: "roi11_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi11_mask_bn2"
  type: "BatchNorm"
  bottom: "roi11_mask_fc1"
  top: "roi11_mask_bn2"
}
layer {
  name: "roi11_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi11_mask_bn2"
  top: "roi11_mask_bn2"
}
layer {
  name: "roi11_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi11_mask_bn2"
  top: "roi11_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi11_mask_bn3"
  type: "BatchNorm"
  bottom: "roi11_mask_fc_2"
  top: "roi11_mask_bn3"
}
layer {
  name: "roi11_mask_scale3"
  type: "Scale"
  bottom: "roi11_mask_bn3"
  top: "roi11_mask_bn3"
}
layer {
  name: "roi12_conv1_1"
  type: "Convolution"
  bottom: "roi12"
  top: "roi12_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi12_bn1_1"
  type: "BatchNorm"
  bottom: "roi12_conv1_1"
  top: "roi12_bn1_1"
}
layer {
  name: "roi12_relu1_1"
  type: "ReLU"
  bottom: "roi12_bn1_1"
  top: "roi12_bn1_1"
}
layer {
  name: "roi12_conv2_1"
  type: "Convolution"
  bottom: "roi12_bn1_1"
  top: "roi12_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi12_bn2_1"
  type: "BatchNorm"
  bottom: "roi12_conv2_1"
  top: "roi12_bn2_1"
}
layer {
  name: "roi12_relu2_1"
  type: "ReLU"
  bottom: "roi12_bn2_1"
  top: "roi12_bn2_1"
}
layer {
  name: "roi12_poo1"
  type: "Pooling"
  bottom: "roi12_bn2_1"
  top: "roi12_poo1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "roi12_mask_conv_1"
  type: "Convolution"
  bottom: "roi12_poo1"
  top: "roi12_mask_conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi12_mask_bn1"
  type: "BatchNorm"
  bottom: "roi12_mask_conv_1"
  top: "roi12_mask_bn1"
}
layer {
  name: "roi12_mask_relu1"
  type: "ReLU"
  bottom: "roi12_mask_bn1"
  top: "roi12_mask_bn1"
}
layer {
  name: "roi12_mask_pool"
  type: "Pooling"
  bottom: "roi12_mask_bn1"
  top: "roi12_mask_pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "roi12_mask_fc1"
  type: "InnerProduct"
  bottom: "roi12_mask_pool"
  top: "roi12_mask_fc1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi12_mask_bn2"
  type: "BatchNorm"
  bottom: "roi12_mask_fc1"
  top: "roi12_mask_bn2"
}
layer {
  name: "roi12_mask_fc_relu1"
  type: "ReLU"
  bottom: "roi12_mask_bn2"
  top: "roi12_mask_bn2"
}
layer {
  name: "roi12_mask_fc_2"
  type: "InnerProduct"
  bottom: "roi12_mask_bn2"
  top: "roi12_mask_fc_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "roi12_mask_bn3"
  type: "BatchNorm"
